"""
Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет
и наличие лекционных, практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий. Сформировать словарь,
содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.

Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —
Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""

import re

with open("test5.txt", "r", encoding="utf-8") as test_file:
    lines = test_file.readlines()
    study = {}
    for line in lines:
        subject, hours = line.strip().split(':')
        hours = re.findall(r'\d+', hours)
        summ = 0
        for hour in hours:
            summ += float(hour)
        study[subject] = summ
    
print(f'Результат:\n{study}')